In [59]:
import numpy as np
import pandas as pd
import os
import matplotlib.pyplot as plt
%matplotlib inline

It happens all the time: someone gives you data containing malformed strings,
Python, lists and missing data. How do you tidy it up so you can get on with the
analysis?
Take this monstrosity as the DataFrame to use in the following puzzles:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [60]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

# question 1
1. Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column).

In [61]:
df['FlightNumber'].isnull()

0    False
1     True
2    False
3     True
4    False
Name: FlightNumber, dtype: bool

In [62]:
df['FlightNumber']=df['FlightNumber'].fillna(10)

In [63]:
df['FlightNumber']=df['FlightNumber']+10

In [64]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10055.0      [23, 47]               KLM(!)
1      MAdrid_miLAN          20.0            []    <Air France> (12)
2  londON_StockhOlm       10075.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis          20.0          [13]       12. Air France
4   Brussels_londOn       10095.0      [67, 32]          "Swiss Air"

In [65]:
df['FlightNumber']=df['FlightNumber'].astype('int64')

In [66]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10055      [23, 47]               KLM(!)
1      MAdrid_miLAN            20            []    <Air France> (12)
2  londON_StockhOlm         10075  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis            20          [13]       12. Air France
4   Brussels_londOn         10095      [67, 32]          "Swiss Air"

# question 2
2. The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.

In [67]:
a=df['From_To'].astype('str')
a

0        LoNDon_paris
1        MAdrid_miLAN
2    londON_StockhOlm
3      Budapest_PaRis
4     Brussels_londOn
Name: From_To, dtype: object

In [68]:
b=[i.split("_") for i in a]
b

[['LoNDon', 'paris'],
 ['MAdrid', 'miLAN'],
 ['londON', 'StockhOlm'],
 ['Budapest', 'PaRis'],
 ['Brussels', 'londOn']]

In [69]:
l1=[i[0] for i in b]
l1

['LoNDon', 'MAdrid', 'londON', 'Budapest', 'Brussels']

In [70]:
l2=[i[1] for i in b]
l2

['paris', 'miLAN', 'StockhOlm', 'PaRis', 'londOn']

In [71]:
df1=pd.DataFrame({'From':['LoNDon', 'MAdrid', 'londON', 'Budapest', 'Brussels'],
                  'to':['paris', 'miLAN', 'StockhOlm', 'PaRis', 'londOn']},
                  index=[0,1,2,3,4])
df1

       From         to
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

# question 3
3. Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)

In [72]:
a=df1[['From','to']].astype('str')
a

       From         to
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

In [73]:
a=[i.title() for i in df1['From']]
a

['London', 'Madrid', 'London', 'Budapest', 'Brussels']

In [74]:
b=[i.title() for i in df1['to']]
b

['Paris', 'Milan', 'Stockholm', 'Paris', 'London']

In [75]:
df1['From']=a

In [76]:
df1['to']=b

In [77]:
df1

       From         to
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

# question 4
4. Delete the From_To column from df and attach the temporary DataFrame
from the previous questions.

In [78]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10055      [23, 47]               KLM(!)
1      MAdrid_miLAN            20            []    <Air France> (12)
2  londON_StockhOlm         10075  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis            20          [13]       12. Air France
4   Brussels_londOn         10095      [67, 32]          "Swiss Air"

In [79]:
df.drop('From_To',axis=1,inplace=True)

In [80]:
df

   FlightNumber  RecentDelays              Airline
0         10055      [23, 47]               KLM(!)
1            20            []    <Air France> (12)
2         10075  [24, 43, 87]  (British Airways. )
3            20          [13]       12. Air France
4         10095      [67, 32]          "Swiss Air"

In [81]:
df['From']=df1['From']

In [82]:
df['To']=df1['to']

In [83]:
df

   FlightNumber  RecentDelays              Airline      From         To
0         10055      [23, 47]               KLM(!)    London      Paris
1            20            []    <Air France> (12)    Madrid      Milan
2         10075  [24, 43, 87]  (British Airways. )    London  Stockholm
3            20          [13]       12. Air France  Budapest      Paris
4         10095      [67, 32]          "Swiss Air"  Brussels     London

# question 5
5. In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each

second value in its own column, and so on. If there isn't an Nth value, the value
should be NaN.
Expand the Series of lists into a DataFrame named delays, rename the columns
delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
with delays.

In [97]:
a=[i for i in df['RecentDelays']]
a

[[23, 47], [], [24, 43, 87], [13], [67, 32]]

In [111]:
delays=pd.DataFrame({'delay_1':[a[0][0],'NaN',a[2][0],a[3][0],a[4][0]],
              'delay_2':[a[0][1],'NaN',a[2][1],'NaN',a[4][1]],
              'delay_3':['NaN','NaN',a[2][2],'NaN','NaN']},
              index=[0,1,2,3,4])
delays

  delay_1 delay_2 delay_3
0      23      47     NaN
1     NaN     NaN     NaN
2      24      43      87
3      13     NaN     NaN
4      67      32     NaN

In [109]:
a[3][0]

13

In [125]:
df['delay_1']=delays['delay_1']

In [126]:
df['delay_2']=delays['delay_2']

In [127]:
df['delay_3']=delays['delay_3']

In [128]:
df

,FlightNumber,RecentDelays,Airline,From,To,delay_1,delay_2,delay_3
0,10055,23,KLM(!),London,Paris,23,47,NaN
1,20,NaN,<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10075,24,(British Airways. ),London,Stockholm,24,43,87
3,20,13,12. Air France,Budapest,Paris,13,NaN,NaN
4,10095,67,"""Swiss Air""",Brussels,London,67,32,NaN

In [131]:
df.drop('RecentDelays',axis=1,inplace=True)

In [132]:
df

,FlightNumber,Airline,From,To,delay_1,delay_2,delay_3
0,10055,KLM(!),London,Paris,23,47,NaN
1,20,<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10075,(British Airways. ),London,Stockholm,24,43,87
3,20,12. Air France,Budapest,Paris,13,NaN,NaN
4,10095,"""Swiss Air""",Brussels,London,67,32,NaN